tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mongodb/brew"

# Version Control & CLI Tools
brew "git"

# Cloud & Infrastructure
brew "awscli"
brew "terraform"
brew "packer"
brew "kubernetes-cli"
brew "minikube"

# Development Languages & Build Tools
brew "node"
brew "python"
brew "openjdk"
brew "gradle"
brew "gradle-completion"
brew "maven"

# DevOps & Configuration Management
brew "ansible"
brew "ansible-lint"

# Media Processing
brew "ffmpeg"

# Shell & Terminal Enhancements
brew "bat"
brew "fzf"
brew "rsync"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Utilities
brew "pipx"
brew "tesseract"

# Fonts
cask "font-jetbrains-mono"

# Applications
cask "linearmouse"
cask "raycast"

# Notes:
# - Install Oh My Zsh: sh -c "$(curl -fsSL https://raw.githubusercontent.com/ohmyzsh/ohmyzsh/master/tools/install.sh)"
# - Install Powerlevel10k: git clone --depth=1 https://github.com/romkatv/powerlevel10k.git ${ZSH_CUSTOM:-$HOME/.oh-my-zsh/custom}/themes/powerlevel10k
