tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mongodb/brew"

# ==============================================================================
# SOFTWARE DEVELOPMENT TOOLS
# ==============================================================================

# Version Control
brew "git"
brew "gh"                                  # GitHub CLI

# Programming Languages & Runtimes
brew "node"
brew "python"
brew "openjdk"
brew "go"                                  # Go programming language

# Java Build Tools
brew "gradle"
brew "gradle-completion"
brew "maven"

# Databases
brew "mongodb-community"
brew "postgresql"                       # PostgreSQL database
brew "redis"                               # In-memory data store

# Development Tools
brew "jq"                                  # JSON processor
brew "yq"                                  # YAML processor
brew "httpie"                              # HTTP client (better than curl)
brew "watch"                               # Execute program periodically

# ==============================================================================
# DEVOPS & INFRASTRUCTURE TOOLS
# ==============================================================================

# Cloud Providers
brew "awscli"

# Infrastructure as Code
brew "terraform"
brew "packer"

# Container Orchestration
brew "kubernetes-cli"
brew "minikube"
brew "helm"                                # Kubernetes package manager
brew "k9s"                                 # Kubernetes TUI

# Containers
brew "docker"
brew "docker-compose"
brew "lazydocker"                          # Docker TUI

# Configuration Management
brew "ansible"
brew "bat"                                 # Better cat with syntax highlighting
brew "fzf"                                 # Fuzzy finder
brew "tmux"                                # Terminal multiplexer
brew "tree"                                # Directory tree viewer
brew "tldr"                                # Simplified man pages
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# System Utilities
brew "rsync"                               # File sync
brew "wget"                                # Download utility
brew "pipx"                                # Python app installer
brew "ripgrep"                             # Better grep
brew "fd"                                  # Better find

# Applications
cask "raycast"                             # Productivity launcher
cask "docker"                              # Docker Desktop
cask "postman"                             # API testing
cask "dbeaver-community"                   # Database tool

# Fonts
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# System Utilities
brew "rsync"                               # File sync
brew "wget"                                # Download utility
brew "pipx"                                # Python app installer

# Applications
cask "raycast"                             # Productivity launcher

# ==============================================================================
# SETUP NOTES
# ==============================================================================
# Install Oh My Zsh:
#   sh -c "$(curl -fsSL https://raw.githubusercontent.com/ohmyzsh/ohmyzsh/master/tools/install.sh)"
#
# Install Powerlevel10k theme:
#   git clone --depth=1 https://github.com/romkatv/powerlevel10k.git ${ZSH_CUSTOM:-$HOME/.oh-my-zsh/custom}/themes/powerlevel10k
